{
  "sections": [
    {
      "title": "About",
      "subtitle": "Jan Pistor - Bureau 314",
      "text": "<p>Jan Pistor is Software Developer and Interaction Designer. Growing up with Commodore 64 and Dreamweaver he became fascinated by the possibilities of technology. Since then he is interested in Web Technologies. Some time later he also added realtime software to his portfolio like TouchDesigner, VVVV or Unity.</p><p>He holds a Bachelor of Science in Media Informatics and a Master of Arts in Interaction Design.</p><p>Prior to getting self-employed he worked at iart (Basel) a Studio working in the Field of Media Architectures and Exhibition Design.</p><p>Offering the following Services</p>",
      "table": {
        "rows": [
          {
            "year": ">",
            "head": "Web Development & Interaction Design",
            "subhead": "Fullstack with e.g. Astro, Vue, Svelte, Tailwind, Typescript, Cockpit, Strapi and more"
          },
          {
            "year": ">",
            "head": "Desktop Applications",
            "subhead": "Based on Web Technologies like Electron and NodeJS"
          },
          {
            "year": ">",
            "head": "Media Consulting for Exhibitions & Media Programming",
            "subhead": "TouchDesigner, Blender, After Effects, DMX/ArtNet, NodeRED"
          }
        ]
      }
    },
    {
      "title": "E-Learning ZHdK",
      "subtitle": "Website, Frontend",
      "media": {
        "path": "./projects/elearning/01.png",
        "video": false,
        "caption": [
          { "head": "Partner", "sub": "ZHDK E-Learning Department" },
          { "head": "Tech", "sub": "SvelteKit, CockpitCMS" },
          { "head": "Scope", "sub": "Frontend & Backend" },
          { "head": "Year", "sub": "2020 - 2021" },
          {
            "head": "Link",
            "sub": "<a href='https://lela.ch' target='blank'>Website</a>"
          }
        ]
      },
      "text": "<p>\"experimental, extended, engaged, equal, epic and endless learning\"</p><p>The use of digital media and end devices are an integral part of everyday life for students and lecturers at the ZHdK. And they also expect this from an educational institution. This self-evident fact should be reflected in the ZHdK's teaching. In doing so, the ZHdK wants to use and shape the dynamics between the digital and physical worlds for development of sustainable concepts.</p><p>Together with Onari Projects from Zurich i was asked to do a rework of the E-Learning Website of the Zurich University of the Arts (ZHdK). Prior to the redesign, the website was basically a simple single page site which was not flexible enough for new digital formats.</p>",
      "gallery": [
        "./projects/elearning/vid_00001.mp4",
        "./projects/elearning/img_00001.png"
      ]
    },
    {
      "title": "LG Flower Meadow",
      "subtitle": "Kinetic Installation",
      "media": {
        "path": "./projects/flower-meadow/intro.mp4",
        "video": true,
        "caption": [
          { "head": "Client", "sub": "iart for LG" },
          { "head": "Tech", "sub": "TouchDesigner, Blender" },
          { "head": "Scope", "sub": "Visual Design" },
          { "head": "Year", "sub": "2020" }
        ]
      },
      "text": "<p>The five kinetic screen sculptures which make up a \"Flower Meadow\" consist individually of six flexible OLED screens. They are arranged in petal-like formation and controlled by a complex drive to open like natural blossoms. A spherical soundtrack accompanies the spectacle which is mounted on the ceiling of 180 The Strand in London's West End.</p><p>The visual piece follows the idea of embracing the form of installation itself by using the 3D model it a translucent material capturing virtually placed light sources. This was then mapped on the physical flower installation. During the \"blooming\", basically when the installation opened the flower petals, AI generated Flowers where displayed on the installation.</p><p>The final form was actually discovered while playing around with simple paper flowers. It was a playful explorative workflow. The whole projec t was very ambitious and luckily \"MKT Engineering\" accepted the challenge to work on a minimal design for the \"real\" Flowers.</p>",
      "gallery": [
        "./projects/flower-meadow/vid_00001.mp4",
        "./projects/flower-meadow/img_00001.png",
        "./projects/flower-meadow/img_00002.png",
        "./projects/flower-meadow/img_00005.png",
        "./projects/flower-meadow/img_00003.png"
      ]
    },
    {
      "title": "LeLa - Lernlabor",
      "subtitle": "Website, Frontend",
      "media": {
        "path": "./projects/lela/01.png",
        "video": false,
        "caption": [
          { "head": "Partner", "sub": "ZHDK E-Learning Department" },
          { "head": "Tech", "sub": "SvelteKit, CockpitCMS" },
          { "head": "Scope", "sub": "Frontend & Backend" },
          { "head": "Year", "sub": "2020 - 2021" },
          {
            "head": "Link",
            "sub": "<a href='https://lela.ch' target='blank'>Website</a>"
          }
        ]
      },
      "text": "<p>LeLa, the Learning Lab for Digital Skills in Higher Education, is a cooperation project of the five Zurich universities: ETH, PHZH, UZH, ZHAW, ZHdK. The swissuniversities federal project P8 aims to promote digital skills among university teachers. The learning lab works together on innovation processes in higher education didactics and development projects for digital skills of university teachers in the digital age.</p>",
      "gallery": [
        "./projects/lela/05.png",
        "./projects/lela/06.png",
        "./projects/lela/lela-mov.mp4"
      ]
    },
    {
      "title": "Laptops in Space",
      "subtitle": "Video Communication, Collective Experience",
      "media": {
        "path": "./projects/laptops-in-space/lis-mov.mp4",
        "video": true,
        "caption": [
          { "head": "Team", "sub": "Jonas Schell, Lukas Seiler" },
          { "head": "Tech", "sub": "Threejs, Supabase, LiveKit, Svelte" },
          { "head": "Scope", "sub": "Frontend Development, 3D Environment" },
          { "head": "Year", "sub": "2020 - 2021" },
          {
            "head": "Link",
            "sub": "<a href='https://laptopsinspace.de' target='blank'>Laptops in Space</a>"
          }
        ]
      },
      "text": "<p>With creativity against the crisis. As a team of three from Bremen, Hamburg and Basel we have tried to develop a positive, creative contribution with our means as an answer to the COVID-19 caused restrictions. We call the project \"Laptops in Space\". A bit like a mixture of video-call and computer game in 3D, with many positive side effects. The platform is free to use. But we also want to offer art, culture and education in particular a platform for digital events.</p><p><br />In LIS, you are placed as a laptop avatar in a 3D universe. You see the keyboard of your laptop cut out in front of you, as if you were looking out of the screen into the world. In LIS, this digital world is outer space. The space for a new world. An ab- tract, almost entirely black space in which one can move and look around as a laptop as in a computer game.</p><p><br />On the virtual laptop screens the webcam image of the visitors can be seen. In addition, you can hear the other visitors via their microphones. However, and this is the special feature, you can only hear the other person loudly and clearly if he or she is also in the vicinity of your own avatar. The further away you are from each other, the quieter the sound of this person becomes. All others in the vicinity, however, remain loud and clear. Thus, small conversation groups can quickly form, resulting in a typical acoustic bar atmosphere.</p><p><br />As much as one can say about the idea and the implementation - \"Laptops in Space\" is an immersive experience. You have to experience it once to understand which new dimension it means for digital events</p>",
      "gallery": [
        "./projects/laptops-in-space/01.png",
        "./projects/laptops-in-space/02.png",
        "./projects/laptops-in-space/03.png",
        "./projects/laptops-in-space/04.png",
        "./projects/laptops-in-space/05.png"
      ]
    },
    {
      "title": "Geoscope 2",
      "subtitle": "Immersive Inflatable 360 Projection",
      "media": {
        "path": "./projects/geoscope/geo-web.mp4",
        "video": true,
        "caption": [
          {
            "head": "Team",
            "sub": "RUR Architects, Unidad de Protocolos, Princeton School of Architecture "
          },
          {
            "head": "Scope",
            "sub": "Ideation, Media Consulting and Production"
          },
          {
            "head": "Year",
            "sub": "2020 - 2022"
          }
        ]
      },
      "text": "<p>Commemorating the 125th anniversary of R. Buckminster Fuller&rsquo;s birth, and celebrating the publication of R. Buckminster Fuller, Pattern- Thinking (Lars Müller Publishers, 2020), this exhibition traces Fuller's ambition to measure physical experience into an ever-expanding pattern of relationships and to coordinate these into a conceptual network of words and concepts that shaped the basis for his thinking.</p></br/><p>R. Buckminster Fuller, Pattern-Thinking follows Fuller&rsquo;s investigations of geometry, structure, language and intellectual property in their relation to design principles and pedagogy, organizing a survey of his work through parallel conceptual threads rather than in a linear chronology. Lines, models, words and concepts emerge as mediums from which to conceive of design as a process of translation, a search for new relationships and generalized principles that can contribute to transdisciplinary knowledge</p><br/><p>Pattern-Thinking comes to Princeton in the form of an immersive, inflatable, multimedia sphere occupied by the public and representing three different archives: Fuller at Princeton, Fuller and Design Education, and Fuller Today. It is a contemporary version of Fuller&rsquo;s Geoscope projects built alongside Princeton students during two different teaching appointments in 1953 and 1960.</p><br/><p>This installation was also shown at the Venice Architecture Biennial and at Roma campus Germany</p>",
      "gallery": [
        "./projects/geoscope/img_00001.jpg",
        "./projects/geoscope/img_00002.jpg",
        "./projects/geoscope/img_00003.jpg",
        "./projects/geoscope/img_00004.jpg",
        "./projects/geoscope/img_00005.jpg"
      ]
    },
    {
      "title": "Talks & Courses",
      "table": {
        "rows": [
          {
            "year": 2023,
            "head": "New Media Operations",
            "subhead": "TouchDesigner Workshop, at HGK Basel</a>"
          },
          {
            "year": 2022,
            "head": "Analog and Physical",
            "subhead": "Web Zurich, Talk together with <a href=\"https://riccardolardi.com/\" target=\"blank\">Riccardo Lardi</a>"
          },
          {
            "year": 2022,
            "head": "Touchdesigner Beginner Workshop",
            "subhead": "Workshop at HGK Basel during Co-Create Week"
          },
          {
            "year": 2022,
            "head": "Mediafacade Workshop Korea",
            "subhead": "Workshop together with Valentin Spiess ( <a href=\"https://iart.ch\" target=\"blank\">iart</a> ) at INHA University Korea"
          },
          {},
          {
            "year": 2020,
            "head": "Agile Methods",
            "subhead": "Workshop at ZHdK for Master Design Students"
          }
        ]
      }
    }
  ]
}
